IDEA Open Model
IAppController.OpenIdeaConnection Method
 Opens the application Idea Connection and waits till this application is closed
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
void OpenIdeaConnection(
	byte[] iom,
	byte[] results,
	byte[] existingConProj,
	byte[] requiredTemplate,
	byte[] importSettings
)
Sub OpenIdeaConnection (
	iom As Byte(),
	results As Byte(),
	existingConProj As Byte(),
	requiredTemplate As Byte(),
	importSettings As Byte()
)
void OpenIdeaConnection(
	array<unsigned char>^ iom,
	array<unsigned char>^ results,
	array<unsigned char>^ existingConProj,
	array<unsigned char>^ requiredTemplate,
	array<unsigned char>^ importSettings
)
Parameters
iom
Type: System.Byte[]
The input stream which includes IdeaOpenModel (in xml format)
results
Type: System.Byte[]
The input stream which includes OpenModelResult (in xml format)
existingConProj
Type: System.Byte[]
The input stream which includes Idea Connection project (binary data)
requiredTemplate
Type: System.Byte[]
The input stream which includes Idea Connection remplate (CONTEMP file)
importSettings
Type: System.Byte[]
Connection import settings
See Also
Reference
IAppController Interface
IdeaRS.OpenModel.Connection Namespace